In [1]:
import pandas as pd
import scipy.stats as stats

df = pd.read_excel('http://taanila.fi/data1.xlsx')
df.head()

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN

In [2]:
stats.pearsonr(df['ikä'], df['palkka'])

(0.2968719048961779, 0.0067615145801081964)

In [3]:
stats.chi2_contingency(pd.crosstab(df['sukup'], df['perhe']))

(3.9518615218205753,
 0.046819548114598535,
 1,
 array([[23.81707317, 39.18292683],
        [ 7.18292683, 11.81707317]]))

In [5]:
pd.crosstab(df['sukup'], df['perhe'])

perhe   1   2
sukup
1      28  35
2       3  16

In [8]:
mies=df['palkka'][df['sukup']==1]
nainen=df['palkka'][df['sukup']==2]
print(mies.mean())
print(nainen.mean())
stats.ttest_ind(mies, nainen, equal_var=False)

2663.746031746032
2232.7368421052633

Ttest_indResult(statistic=3.0597612743474714, pvalue=0.003048272029697872)

In [9]:
k1 = df['palkka'][df['koulutus']==1] #peruskoulu
k2 = df['palkka'][df['koulutus']==2] #2. aste
k3 = df['palkka'][df['koulutus']==3] #korkeakoulu
k4 = df['palkka'][df['koulutus']==4] #ylempi korkeakoulu
stats.f_oneway(k1,k2,k3,k4)

F_onewayResult(statistic=11.675086950951924, pvalue=2.186573534680074e-06)